<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
  <meta http-equiv="content-language" content="de">
  <meta name="author" content="Malte Knoerr">
  <meta name="description" content="Software f&uuml;r verschl&uuml;sselte Backups">
  <meta name="keywords" content="backup, verschl&uuml;sselt, Verschl&uuml;sselung, sicher, unix, linux">
<title>Krypto CD - Sichere Backups</title> </head>
<body bgcolor="#FFFFFF">


<table>
<tr>
<td valign=top width="20%">
<img src="img/spacer.png" alt="" width=1 height=77 border=0>
<h1>&nbsp;</h1>

<p><b>Inhalt</b></p>
<p>Startseite</p>
<p><a href="development-de.html">Entwicklung</a></p>
</td>

<td valign=top width="60%">
<p><img src="img/logo.png" alt="KryptoCD" width=330 height=77 border=0></p>

<h1>Sichere Backups</h1>
<p>Der Zweck von KryptoCD ist, auf einfache Art und Weise verschl&uuml;sselte
Sicherheitskopien (Backups) von wichtigen Dateien zu erstellen. Es ist ein
Frontend f&uuml;r einige gebr&auml;uchliche
<a href="http://www.gnu.org/home.de.html">GNU</a> Tools und enth&auml;lt
selbst keine kryptografische Software. Sie ben&ouml;tigen f&uuml;r die
Verschl&uuml;sselung <a href="http://www.gnupg.org/de/gnupg.html">GnuPG</a>.
GnuPG ist vertrauensw&uuml;rdig, seine Entwicklung wird vom
<a href="http://www.sicherheit-im-internet.de">Bundesministerium f&uuml;r
Wirtschaft und Technologie (BMWi)</a> gef&ouml;rdert.
</p>
<h2>Warum sollte man Sicherungskopien verschl&uuml;sseln?</h2>
<p>Vermutlich benutzen Sie mit Unix ein recht sicheres Betriebssystem. Andere
Benutzer k&ouml;nnen beispielsweise Ihre privaten Daten nicht lesen. Aber wenn
sie eine Sicherungskopie dieser Daten zum Beispiel auf eine CD brennen,
kann jeder diese CD in sein Dateisystem einbinden und Ihre Daten lesen.
</p>
<p>Durch unverschl&uuml;sselte Sicherungskopien entsteht also eine
Sicherheitsl&uuml;cke. Sie k&ouml;nnen zur L&ouml;sung dieses Problems
nat&uuml;rlich Ihre Sicherheitskopien an einem sicheren Ort wie einem Tresor
aufbewahren, aber Sie k&ouml;nnen Ihre Daten auch einfach verschl&uuml;sseln.
</p>
<p>Sie k&ouml;nnen KryptoCD nat&uuml;rlich nicht nur f&uuml;r
Sicherheitskopien verwenden: Wenn Sie jemandem per CD wichtige Daten
zukommen lassen wollen, k&ouml;nnen Sie diese daf&uuml;r auch
verschl&uuml;sseln. Der Empf&auml;nger muss allerdings ebenfalls GnuPG und
andere GNU Tools benutzen, um die Daten wieder entschl&uuml;sseln zu
k&ouml;nnen.</p>

<h2>Wie funktioniert KryptoCD?</h2>
KryptoCD funktioniert noch garnicht, es befindet sich n&auml;mlich noch in der
Planungsphase. Es wird GnuPG zu Verschl&uuml;sselung Ihrer Sicherungskopien
verwenden. Sie k&ouml;nnen dann Dateien oder ganze Verzeichnisse
ausw&auml;hlen, diese werden komprimiert (tar, bzip2), verschl&uuml;sselt
(gnupg) und anschlie&szlig;end auf CDs gebrannt (cdrecord).

<h2>Wo ist KryptoCD erh&auml;ltlich?</h2>
KryptoCD ist <a href="http://www.opensource.org">Open Source</a>. Sie
k&ouml;nnen KryptoCD, nachdem es erschienen ist, bei
<a href="http://developer.berlios.de/projects/kryptocd/">BerliOS</a>
herunterladen. Sie werden KDE 2 ben&ouml;tigen, um KryptoCD benutzen zu
k&ouml;nnen.
<br><br>
<div align="center">
<font size="-1">Zuletzt am 22. Dezember 2000 aktualisiert.<br>
<a href="mailto:malte@knoerr.escape.de">Malte Kn&ouml;rr</a></font>
<p>
<a href="http://validator.w3.org/check/referer"><img border="0" src="img/valid-html40.png"  alt="Valid HTML 4.0!" height="31" width="88"></a>  </p>

</div>
</td>

<td valign=top width="20%">
<div align="right"><a href="index.html">English</a></div>
</td>
</tr>
</table>

</body> </html>
